%function lab04_main
%=== Дисципліна: Основи обробки біомедичнеої інформації ===
%--- Лабораторна робота #4 ОПТИМАЛЬНА І АДАПТИВНА ФІЛЬТРАЦІЯ БІОСИГНАЛІВ 
%
% Використовуйте файли даних: 
% ecg2x60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%
% Функції (m-файли), що необхідно розробити:
% wiener_hopf.m - обчислення коефіцієнтів фільтра Вінера
% lms.m - LMS-алгоритм адаптації
%----------------------------------------------------------
clear, clc, close all
disp('Лабораторна робота #4')
disp('ОПТИМАЛЬНА І АДАПТИВНА ФІЛЬТРАЦІЯ БІОСИГНАЛІВ')
disp('Виконав: Шелемба П.В., група БМ-462 ННІІДС')

%=== Завдання #1.1 ===
% Моделювання досліджуваного сигналу
 fs = 200; N = 400; 
 t = (0:(N-1))/fs; % вектор часу
 v = 2*randn(size(t));  
 s = sin(2*pi*10*t)+sin(2*pi*20*t);
 x = s+v;

%=== Завдання #1.2 ===
%Синтезування оптимального фільтру Вінера довжиною L=32
 L = 32; % порядок фільтра
 b = wiener_hopf(x, s, L); % обчислення коефіцієнтів

%=== Завдання #1.3 ===
 %Фільтрація досліджуваного сигналу 
 a = 1;
 y1 = filter(b, a, x);
figure(1)
subplot(3, 1, 1); plot(t, x), grid on;
title('Сигнал з шумом'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, s); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 3); plot(t, y1); grid on;
title('Відфільтрований сигнал'); xlabel('Відліки'); ylabel('Амплітуда');7

% ------ АЧХ фільтру Вінера
n = 512; % кількість точок, що розраховуються
figure(2)
[h1, f1] = freqz(b, a, n);
mag1 = abs(h1);
plot(f1/(2*pi)*fs, mag1), grid on;
title('АЧХ оптимального фільтру'); xlabel('Відліки'); ylabel('Підсилення');
 