%=== Завдання #2.1 ===
% Моделювання досліджуваного сигналу
fs = 200; N = 400; 
 t = (0:(N-1))/fs; % вектор часу
 v = 2*randn(size(t));  
 s = sin(2*pi*10*t);
 x = s+v;

%=== Завдання #2.3 ===
% Синтез адаптивного фільтру. Фільтрація змодельваного сигналу.
L1 = 128; mu = 0.0001; a = 1;
[y, e, b] = lms(x, s, mu, L1);
% Графіки результату фільтрації
figure(9);
subplot(3, 1, 1); plot(t, s); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, y); grid on;
title('Відфільтрований сигнал при L = 128 (адаптивний фільтр)'); 
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 128
n = 512; % кількість точок, що розраховуються
[h1, f1] = freqz(b, a, n);
mag1 = abs(h1);
subplot(3, 1, 3); plot(f1/(2*pi)*fs, mag1), grid on;
title('АЧХ адаптивного фільтру при L = 128'); 
xlabel('Відліки'); ylabel('Підсилення');

%=== Завдання #2.4 ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації
mu1 = 0.01;
[y1, e, b] = lms(x, s, mu1, L1);
% Графіки результату фільтрації
figure(10);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y1); grid on;
title('Відфільтрований сигнал (mu = 0.01) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu2 = 0.001;
[y2, e, b] = lms(x, s, mu2, L1);
% Графіки результату фільтрації
figure(11);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y2); grid on;
title('Відфільтрований сигнал (mu = 0.001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu3 = 0.0001;
[y3, e, b] = lms(x, s, mu3, L1);
% Графіки результату фільтрації
figure(12);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y3); grid on;
title('Відфільтрований сигнал (mu = 0.0001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu4 = 0.00001;
[y4, e, b] = lms(x, s, mu4, L1);
% Графіки результату фільтрації
figure(13);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y4); grid on;
title('Відфільтрований сигнал (mu = 0.00001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu5 = 0.000001;
[y5, e, b] = lms(x, s, mu5, L1);
% Графіки результату фільтрації
figure(14);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y5); grid on;
title('Відфільтрований сигнал (mu = 0.000001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

%=== Завдання #2.5 ===
% Дослідження процедури адаптивної фільтрації при різній довжині фільтру
% L2 = 256
N2 = 400; 
 t2 = (0:(N2-1))/fs; % вектор часу
 v2 = 2*randn(size(t2));  
 s2 = sin(2*pi*10*t2);
 x2 = s2+v2;
L2 = 256;
[y6, e, b2] = lms(x2, s2, mu, L2);
% Графіки результату фільтрації
figure(15);
subplot(3, 1, 1); plot(t2, x2); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t2, y6); grid on;
title('Відфільтрований сигнал (L = 256) (адаптивний фільтр)'); 
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 256
[h2, f2] = freqz(b2, a, n);
mag2 = abs(h2);
subplot(3, 1, 3); plot(f2/(2*pi)*fs, mag2), grid on;
title('АЧХ адаптивного фільтру при L = 256 (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Підсилення');

% L3 = 512
N3 = 800; 
 t3 = (0:(N3-1))/fs; % вектор часу
 v3 = 2*randn(size(t3));  
 s3 = sin(2*pi*10*t3);
 x3 = s3+v3;
L3 = 512;
[y7, e, b3] = lms(x3, s3, mu, L3);
% Графіки результату фільтрації
figure(16);
subplot(3, 1, 1); plot(t3, x3); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t3, y7); grid on;
title('Відфільтрований сигнал (L = 512) (адаптивний фільтр)');
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 512
[h3, f3] = freqz(b3, a, n);
mag3 = abs(h3);
subplot(3, 1, 3); plot(f3/(2*pi)*fs, mag3), grid on;
title('АЧХ адаптивного фільтру при L = 512 (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Підсилення');

% L4 = 1024
N4 = 1400; 
 t4 = (0:(N4-1))/fs; % вектор часу
 v4 = 2*randn(size(t4));  
 s4 = sin(2*pi*10*t4);
 x4 = s4+v4;
L4 = 1024;
[y8, e, b4] = lms(x4, s4, mu, L4);
% Графіки результату фільтрації
figure(17);
subplot(3, 1, 1); plot(t4, x4); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t4, y8); grid on;
title('Відфільтрований сигнал (L = 1024) (адаптивний фільтр)'); 
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 1024
[h4, f4] = freqz(b4, a, n);
mag4 = abs(h4);
subplot(3, 1, 3); plot(f4/(2*pi)*fs, mag4), grid on;
title('АЧХ адаптивного фільтру при L = 1024 (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Підсилення');