%=== Завдання #2.1 ===
% Моделювання досліджуваного сигналу
fs = 200; N = 400; 
 t = (0:(N-1))/fs; % вектор часу
 v = 2*randn(size(t));  
 s = sin(2*pi*10*t);
 x = s+v;

%=== Завдання #2.3 ===
% Синтез адаптивного фільтру. Фільтрація змодельваного сигналу.
L1 = 128; mu = 0.0001; a = 1;
[y, e, b] = lms(x, s, mu, L1);
% Графіки результату фільтрації
figure(9);
subplot(3, 1, 1); plot(t, s); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, y); grid on;
title('Відфільтрований сигнал при L = 128 (адаптивний фільтр)'); 
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 128
n = 512; % кількість точок, що розраховуються
[h1, f1] = freqz(b, a, n);
mag1 = abs(h1);
subplot(3, 1, 3); plot(f1/(2*pi)*fs, mag1), grid on;
title('АЧХ адаптивного фільтру при L = 128 (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Підсилення');

%=== Завдання #2.4 ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації
mu1 = 0.01;
[y1, e, b] = lms(x, s, mu1, L1);
% Графіки результату фільтрації
figure(10);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y1); grid on;
title('Відфільтрований сигнал (L = 128, mu = 0.01) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu2 = 0.001;
[y2, e, b] = lms(x, s, mu2, L1);
% Графіки результату фільтрації
figure(11);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y2); grid on;
title('Відфільтрований сигнал (L = 128, mu = 0.001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu3 = 0.0001;
[y3, e, b] = lms(x, s, mu3, L1);
% Графіки результату фільтрації
figure(12);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y3); grid on;
title('Відфільтрований сигнал (L = 128, mu = 0.0001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu4 = 0.00001;
[y4, e, b] = lms(x, s, mu4, L1);
% Графіки результату фільтрації
figure(13);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y4); grid on;
title('Відфільтрований сигнал (L = 128, mu = 0.00001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu5 = 0.000001;
[y5, e, b] = lms(x, s, mu5, L1);
% Графіки результату фільтрації
figure(14);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y5); grid on;
title('Відфільтрований сигнал (L = 128, mu = 0.000001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');