%=== Завдання #3.1 ===
% Моделювання досліджуваного сигналу
fs = 200; 
N = 400;
t = (0:(N-1))/fs;
s1 = sin(2*pi*10*t);   
s2 = sin(2*pi*20*t); 
s = [s1 s2];
t = (0:length(s)-1)/fs;
v = 2*randn(size(t));  
x = s+v;

%=== Завдання #3.2 ===
% Фільтрація сигналу адаптивним фільтром
% Синтез адаптивного фільтру. Фільтрація змодельваного сигналу.
L = 128; mu = 0.000001; a = 1;
[y, e, b] = lms(x, s, mu, L);
% Графіки результату фільтрації
figure(18);
subplot(3, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, y); grid on;
title('Відфільтрований сигнал (mu = 0.000001) (адаптивний фільтр)');
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру
n = 512; % кількість точок, що розраховуються
[h, f] = freqz(b, a, n);
mag = abs(h);
subplot(3, 1, 3); plot(f/(2*pi)*fs, mag), grid on;
title('АЧХ адаптивного фільтру (mu = 0.000001)'); xlabel('Відліки'); ylabel('Підсилення');

%=== Завдання #3.3  ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації
mu1 = 0.01;
[y1, e, b] = lms(x, s, mu1, L);
% Графіки результату фільтрації
figure(19);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y1); grid on;
title('Відфільтрований сигнал (mu = 0.01) (адаптивний фільтр)');
xlabel('Відліки'); ylabel('Амплітуда');

mu2 = 0.001;
[y2, e, b] = lms(x, s, mu2, L);
% Графіки результату фільтрації
figure(20);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y2); grid on;
title('Відфільтрований сигнал (mu = 0.001) (адаптивний фільтр)');
xlabel('Відліки'); ylabel('Амплітуда');

mu3 = 0.0001;
[y3, e, b] = lms(x, s, mu3, L);
% Графіки результату фільтрації
figure(21);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y3); grid on;
title('Відфільтрований сигнал (mu = 0.0001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu4 = 0.00001;
[y4, e, b] = lms(x, s, mu4, L);
% Графіки результату фільтрації
figure(22);
subplot(2, 1, 1); plot(t, x); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t, y4); grid on;
title('Відфільтрований сигнал (mu = 0.00001) (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Амплітуда');

%=== Завдання #3.4 ===
% Дослідження процедури адаптивної фільтрації при різній довжині фільтру
