%=== Завдання #3.1 ===
fs = 200;
% Моделювання досліджуваного сигналу 
N1 = 400;
t1_1 = (0:(N1-1))/fs;
s1_1 = sin(2*pi*10*t1_1);   
s2_1 = sin(2*pi*20*t1_1); 
s1 = [s1_1 s2_1];
t2_1 = (0:length(s1)-1)/fs;
v1 = 2*randn(size(t2_1));  
x1 = s1+v1;

%=== Завдання #3.2 ===
% Фільтрація сигналу адаптивним фільтром
 a = 1;
% Синтез адаптивного фільтру. Фільтрація змодельваного сигналу.
L1 = 128; mu1 = 0.0001;
[y1, e1, b1] = lms(x1, s1, mu1, L1);
% Графіки результату фільтрації
figure(18);
subplot(3, 1, 1); plot(t2_1, x1); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t2_1, y1); grid on;
title('Адаптивно відфільтрований сигнал (L = 128, mu = 0.0001)');
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру
n = 512; % кількість точок, що розраховуються
[h1, f1] = freqz(b1, a, n);
mag1 = abs(h1);
subplot(3, 1, 3); plot(f1/(2*pi)*fs, mag1), grid on;
title('АЧХ адаптивного фільтру (L = 128, mu = 0.0001)');
xlabel('Відліки'); ylabel('Підсилення');

%=== Завдання #3.3  ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації
mu2 = 0.01;
[y2, e2, b_2] = lms(x1, s1, mu2, L1);
% Графіки результату фільтрації
figure(19);
subplot(2, 1, 1); plot(t2_1, x1); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t2_1, y2); grid on;
title('Адаптивно відфільтрований сигнал (L = 128, mu = 0.01)');
xlabel('Відліки'); ylabel('Амплітуда');

mu3 = 0.001;
[y3, e3, b_3] = lms(x1, s1, mu3, L1);
% Графіки результату фільтрації
figure(20);
subplot(2, 1, 1); plot(t2_1, x1); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t2_1, y3); grid on;
title('Адаптивно відфільтрований сигнал (L = 128, mu = 0.001)');
xlabel('Відліки'); ylabel('Амплітуда');

mu4 = 0.00001;
[y4, e4, b_4] = lms(x1, s1, mu4, L1);
% Графіки результату фільтрації
figure(22);
subplot(2, 1, 1); plot(t2_1, x1); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t2_1, y4); grid on;
title('Адаптивно відфільтрований сигнал (L = 128, mu = 0.00001)'); 
xlabel('Відліки'); ylabel('Амплітуда');

mu5 = 0.000001;
[y5, e5, b_5] = lms(x1, s1, mu5, L1);
% Графіки результату фільтрації
figure(22);
subplot(2, 1, 1); plot(t2_1, x1); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(2, 1, 2); plot(t2_1, y5); grid on;
title('Адаптивно відфільтрований сигнал (L = 128, mu = 0.000001)'); 
xlabel('Відліки'); ylabel('Амплітуда');

%=== Завдання #3.4 ===
% Дослідження процедури адаптивної фільтрації при різній довжині фільтру
% L2 = 256
L2 = 256;
[y6, e6, b2] = lms(x1, s1, mu1, L2);
% Графіки результату фільтрації
figure(23);
subplot(3, 1, 1); plot(t2_1, x1); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t2_1, y6); grid on;
title('Адаптивно відфільтрований сигнал (L = 256, mu = 0.0001)'); 
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 256
[h2, f2] = freqz(b2, a, n);
mag2 = abs(h2);
subplot(3, 1, 3); plot(f2/(2*pi)*fs, mag2), grid on;
title('АЧХ адаптивного фільтру(L = 256, mu = 0.0001)'); 
xlabel('Відліки'); ylabel('Підсилення');

% L3 = 512
N3 = 800;
t1_3 = (0:(N3-1))/fs;
s1_3 = sin(2*pi*10*t1_3);   
s2_3 = sin(2*pi*20*t1_3); 
s3 = [s1_3 s2_3];
t2_3 = (0:length(s3)-1)/fs;
v3 = 2*randn(size(t2_3));  
x3 = s3+v3;
L3 = 512;
[y7, e7, b3] = lms(x3, s3, mu1, L3);
%Графіки результату фільтрації
figure(24);
subplot(3, 1, 1); plot(t2_3, x3); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t2_3, y7); grid on;
title('Адаптивно відфільтрований сигнал (L = 512, mu = 0.0001)');
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 512
[h3, f3] = freqz(b3, a, n);
mag3 = abs(h3);
subplot(3, 1, 3); plot(f3/(2*pi)*fs, mag3), grid on;
title('АЧХ адаптивного фільтру (L = 512, mu = 0.0001)'); 
xlabel('Відліки'); ylabel('Підсилення');

% L4 = 1024
N4 = 2000;
t1_4 = (0:(N4-1))/fs;
s1_4 = sin(2*pi*10*t1_4);   
s2_4 = sin(2*pi*20*t1_4); 
s4 = [s1_4 s2_4];
t2_4 = (0:length(s4)-1)/fs;
v4 = 2*randn(size(t2_4));  
x4 = s4+v4;
L4 = 1024;
[y8, e8, b4] = lms(x4, s4, mu1, L4);
% Графіки результату фільтрації
figure(25);
subplot(3, 1, 1); plot(t2_4, x4); grid on;
title('Сигнал зі змінною частотою з шумом'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t2_4, y8); grid on;
title('Адаптивно відфільтрований сигнал (L = 1024, mu = 0.0001)'); 
ylabel('Амплітуда');

% ------ АЧХ адаптивного фільру довжиною L = 1024
[h4, f4] = freqz(b4, a, n);
mag4 = abs(h4);
subplot(3, 1, 3); plot(f4/(2*pi)*fs, mag4), grid on;
title('АЧХ адаптивного фільтру (L = 1024, mu = 0.0001)'); 
xlabel('Відліки'); ylabel('Підсилення');