%=== Завдання #2.1 ===
% Моделювання досліджуваного сигналу
fs = 200; N = 400; 
 t = (0:(N-1))/fs; % вектор часу
 v = 2*randn(size(t));  
 s = sin(2*pi*10*t);
 x = s+v;

%=== Завдання #2.3 ===
% Синтезу адаптивного фільтру. Фільтрація змодельваного сигналу.
L1 = 128; mu = 0.0001; a = 1;
[y, e, b] = lms(x, s, mu, L1);
% Графіки результату фільтрації
figure(9)
subplot(3, 1, 1); plot(t, s); grid on;
title('Сигнал без шуму'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, y); grid on;
title('Відфільтрований сигнал при L = 128 (адаптивний фільтр)'); 
ylabel('Амплітуда');

% ------ АЧХ фільтру Вінера довжиною L=32
n = 512; % кількість точок, що розраховуються
[h1, f1] = freqz(b, a, n);
mag1 = abs(h1);
subplot(3, 1, 3); plot(f1/(2*pi)*fs, mag1), grid on;
title('АЧХ адаптивного фільтру при L = 128 (адаптивний фільтр)'); 
xlabel('Відліки'); ylabel('Підсилення');