%=== Завдання #4.1 ===
% Завантаження сигналу ЕКГ з перешкодою (файл ecg2x60.dat) 
ecg = load('ecg2x60.dat');

%=== Завдання #4.2 ===
% Фільтрація сигналу адаптивним фільтром
fs = 200; f = 60;
t = (0:length(ecg)-1)/fs;
d = [cos(2*pi*f*t); sin(2*pi*f*t)]; % опорний сигнал
mu1 = 0.1;
[y1, e1, b1] = lms60(ecg, d, mu1);

% Графіки результату фільтрації
figure(26);
subplot(3, 1, 1); plot(t, ecg), grid on;
title('Сигнал ЕКГ з перешкодою'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, e1); grid on;
title('Адаптивно відфільрований сигнал ЕКГ (mu = 0.1)'); ylabel('Амплітуда');
subplot(3, 1, 3); plot(t, y1); grid on;
title('Вихідний сигнал адаптивного фільтра (mu = 0.1)');
xlabel('Відліки'); ylabel('Амплітуда');

% АЧХ адаптивного фільтру
a = 1;
n = 512; % кількість точок, що розраховуються
figure(27);
[h, f] = freqz(b1, a, n);
mag = abs(h);
plot(f/(2*pi)*fs, mag), grid on;
title('АЧХ адаптивного фільтру'); 
xlabel('Відліки'); ylabel('Підсилення');

%=== Завдання #4.3 ===
% Визначення значення коефіцієнтів адаптивного фільтру 
% після закінчення адаптації
disp('Значення коефіцієнтів адаптивного фільтру після закінчення адаптації:');
disp(b1);

%=== Завдання #4.4 ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації
mu2 = 0.01;
[y2, e2, b2] = lms60(ecg, d, mu2);
figure(28);
subplot(3, 1, 1); plot(t, ecg), grid on;
title('Сигнал ЕКГ з перешкодою'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, e2); grid on;
title('Адаптивно відфільрований сигнал ЕКГ (mu = 0.01)'); 
ylabel('Амплітуда');
subplot(3, 1, 3); plot(t, y2); grid on;
title('Вихідний сигнал адаптивного фільтра (mu = 0.01)');
xlabel('Відліки'); ylabel('Амплітуда');

mu3 = 0.001;
[y3, e3, b3] = lms60(ecg, d, mu3);
figure(29);
subplot(3, 1, 1); plot(t, ecg), grid on;
title('Сигнал ЕКГ з перешкодою'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, e3); grid on;
title('Адаптивно відфільрований сигнал ЕКГ (mu = 0.001)');
ylabel('Амплітуда');
subplot(3, 1, 3); plot(t, y3); grid on;
title('Вихідний сигнал адаптивного фільтра (mu = 0.001)');
xlabel('Відліки'); ylabel('Амплітуда');

mu4 = 0.0001;
[y4, e4, b4] = lms60(ecg, d, mu4);
figure(30);
subplot(3, 1, 1); plot(t, ecg), grid on;
title('Сигнал ЕКГ з перешкодою'); ylabel('Амплітуда');
subplot(3, 1, 2); plot(t, e4); grid on;
title('Адаптивно відфільрований сигнал ЕКГ (mu = 0.0001)');
ylabel('Амплітуда');
subplot(3, 1, 3); plot(t, y4); grid on;
title('Вихідний сигнал адаптивного фільтра (mu = 0.0001)');
xlabel('Відліки'); ylabel('Амплітуда');