%function lab04_main
%=== Дисципліна: Основи обробки біомедичнеої інформації ===
%--- Лабораторна робота #4 ОПТИМАЛЬНА І АДАПТИВНА ФІЛЬТРАЦІЯ БІОСИГНАЛІВ 
%
% Використовуйте файли даних: 
% ecg2x60.dat - сигнал ЕКГ з мережевою перешкодою частотою 60 Гц
%
% Функції (m-файли), що необхідно розробити:
% wiener_hopf.m - обчислення коефіцієнтів фільтра Вінера
% lms.m - LMS-алгоритм адаптації
%----------------------------------------------------------
clear, clc, close all
disp('Лабораторна робота #4')
disp('ОПТИМАЛЬНА І АДАПТИВНА ФІЛЬТРАЦІЯ БІОСИГНАЛІВ')
disp('Виконав:  , група ... ННІІДС')

%=== Завдання #1.1 ===
% Моделювання досліджуваного сигналу
 fs =  ; N =  ; 
 t =  ;		% вектор часу
 x =  ;
 v =  ;  
 s =  ;

 fs =  ; N =  ; t =  ;		% вектор часу
 s =  ;
 v =  ;  
 x =  ;

%=== Завдання #1.2 ===
 Синтезування оптимального фільтру Вінера довжиною L=32
 L =  ; 			       % порядок фільтра
 b = wiener_hopf(...);	   % обчислення коефіцієнтів

%=== Завдання #1.3 ===
 %Фільтрація досліджуваного сигналу 
 a = ;
 y = filter(...);
figure()
 ... 
% ------ АЧХ фільтру Вінера
 n = ;  % кількість точок, що розраховуються
 figure()
 [...] = freqz(...);
 mag = abs(...);
plot(...)
 
 
 L = ...; 			       % порядок фільтра
 b = ...;	   % обчислення коефіцієнтів
 % АЧХ фільтру Вінера
 n = ...;  % кількість точок, що розраховуються
 figure()
 [...] = freqz(...);
 ...

 % L = 128
 L = ; 			       % порядок фільтра
 b = ;	   % обчислення коефіцієнтів
 % АЧХ фільтру Вінера
 n = ;  % кількість точок, що розраховуються
 figure() ...
 % L = 256
 L = ; 			       % порядок фільтра
 b = ;	   % обчислення коефіцієнтів
 % АЧХ фільтру Вінера
 n = ;  % кількість точок, що розраховуються
 figure()
 ...
 
 % Обчислення дисперсії передачі сигналу оптимальним фільтром
 ...

%=== Завдання #2.1 ===
% Моделювання досліджуваного сигналу
fs = ; 
N =  ; 
t =  ;		% вектор часу
s =  ;
v =  ;  
x =  ;

%=== Завдання #2.2 ===
% Синтезу адаптивного фільтру. Фільтрація змодельваного сигналу.
L =  ; mu =  ;
[...] = lms(...);
% Графіки результату фільтрації
figure()
...

% ----- АЧХ адаптивного фільтру
n =  ;  % кількість точок, що розраховуються
figure()
a =  ;
[...] = freqz(...);
...

%=== Завдання #2.3 ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації

%=== Завдання #2.4 ===
% Дослідження процедури адаптивної фільтрації при різній довжині фільтру

L = ; mu = ;
[...] = lms(...);
% Графіки результату фільтрації
figure()
...

L =  ; mu =  ;
[...] = lms(...);
% Графіки результату фільтрації
figure()
...

L = ; mu = ;
[...] = lms(...);
% Графіки результату фільтрації
...

%=== Завдання #3.1 ===
% Моделювання досліджуваного сигналу
fs =  ; 
N =  ;
x1 =  ;   
x2 =  ; 
x =  ;
t =  ;
v =  ;  
s =  ;

% Фільтрація сигналу адаптивним фільтром
L =  ; mu =  ;
[...] = lms(...);
% Графіки результату фільтрації
figure()
...

% АЧХ адаптивного фільтру
n =  ;  % кількість точок, що розраховуються
figure()
...

%=== Завдання #3.3  ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації

%=== Завдання #3.4 ===
% Дослідження процедури адаптивної фільтрації при різній довжині фільтру

%=== Завдання #4.1 ===
% Завантаження сигналу ЕКГ з перешкодою (файл ecg2x60.dat) 
ecg = load(...);

%=== Завдання #4.2 ===
% Фільтрація сигналу адаптивним фільтром
fs =  ; f =  ;
t =  ;
d =  ;		% опорний сигнал
mu =  ;
[...] = lms60(...);

% Графіки результату фільтрації
figure()
...

% АЧХ адаптивного фільтру
n =  ;  % кількість точок, що розраховуються

[...] = freqz(...);
mag = abs(.);
...

%=== Завдання #4.3 ===
% Визначення значення коефіцієнтів адаптивного фільтру після закінчення адаптації

%=== Завдання #4.4 ===
% Дослідження залежності часу адаптації від коефіцієнта адаптації

